#include <stdio.h>

int main() {
  int a, b;
  float d, r, sum; // d- Залишок ділення першого на друге, r- різниця, sum - сума
  printf("Задайте два цілих числа:\n");

  printf("\nВведіть перше число: ");
  scanf("%d", &a);

  printf("Введіть друге число: ");
  scanf("%d", &b);

  // Обчислення
  d = a % b;
  r = b - a;
  sum = a + b;

  printf("\n***Результати***\n");

  printf("Число 1 = %d\n", a);
  printf("Число 2 = %d\n\n", b);

  printf("Залишок ділення першого числа на друге = %.f\n", d);
  printf("Різниця другого та першого числа = %.f\n", r);
  printf("Сума першого та другого числа = %.f", sum);

  return 0;
}
